In [1]:
import pandas as pd

In [19]:
# DataFrames
# Construção a partir de dicionários ou listas
nomes = ['Xerxes','Calvin','Cinza']
gatos = {'nome':['Xerxes','Calvin','Cinza','Brancão'],
         'idade':[16,6,16,8],
         'peso':[3.5,8,3,5]}

nomes_df = pd.DataFrame(nomes)
nomes_df

        0
0  Xerxes
1  Calvin
2   Cinza

In [20]:
gatos_df = pd.DataFrame(gatos)
gatos_df

      nome  idade  peso
0   Xerxes     16   3.5
1   Calvin      6   8.0
2    Cinza     16   3.0
3  Brancão      8   5.0

In [21]:
# Selecionando colunas e linhas
gatos_df['nome'][0]

'Xerxes'

In [22]:
gatos_df['nome'] == 'Xerxes'

0     True
1    False
2    False
3    False
Name: nome, dtype: bool

In [24]:
gatos_df[gatos_df['nome'] == 'Xerxes']

     nome  idade  peso
0  Xerxes     16   3.5

In [25]:
gatos_df[gatos_df['idade'] > 10]

     nome  idade  peso
0  Xerxes     16   3.5
2   Cinza     16   3.0

In [26]:
gatos_df.groupby('idade').count()

       nome  peso
idade
6         1     1
8         1     1
16        2     2

In [27]:
# Análise descritiva
gatos_df.mean()

/tmp/ipykernel_81935/1561658842.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  gatos_df.mean()

idade    11.500
peso      4.875
dtype: float64

In [28]:
gatos_df.describe()

           idade   peso
count   4.000000  4.000
mean   11.500000  4.875
std     5.259911  2.250
min     6.000000  3.000
25%     7.500000  3.375
50%    12.000000  4.250
75%    16.000000  5.750
max    16.000000  8.000

In [29]:
# Espalhamento
amplitude = gatos_df['idade'].max() - gatos_df['idade'].min()
amplitude

10

In [30]:
gatos_df.std()

/tmp/ipykernel_81935/3193627653.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  gatos_df.std()

idade    5.259911
peso     2.250000
dtype: float64

In [31]:
# Correlação
gatos_df.corr()

          idade      peso
idade  1.000000 -0.908338
peso  -0.908338  1.000000